[
  {
    "content": {
      "nl": {
        "author": "Jurgen van Kreij",
        "publish_date": "2017-09-21T22:00:00.000Z",
        "body": "<p>Wij hebben sinds enkele weken de nieuwste Oculus Rift op kantoor. Ik ben enorm onder de indruk van de Virtual Reality ervaring. We hebben eerder al geëxperimenteerd met de voorzetbrillen waar een telefoon in gaat (Homido, Oculus VR en Google Cardboard) maar dit is echt mindblowing.</p><p><br></p><p>Je kunt volledig rond kijken waarbij het beeld perfect meebeweegt, maar ook wanneer je opzij stapt en dichterbij buigt gaat het beeld realistisch mee. Je bent, zodra je de bril opzet, echt in een andere wereld! Op dit moment zijn er twee soorten applicaties: in de echte wereld opgenomen reportages waar je als toeschouwer kunt rond kijken. JauntVR is hier goed in en heeft daar ook speciale 360-graden camera’s voor gemaakt. En volledig virtuele werelden waarin je kunt rondlopen, dat zijn meestal de spellen en simulaties en zelf actief kunt zijn.</p><p>Kom gerust een keer langs om het te ervaren.</p><h2>Toepassingen?</h2><p>We zijn aan het experimenteren met toepassingen. Toepassingen waar wij aan denken zijn visualisatie van complexe data of een virtuele control room. In samenwerking met de Universiteit Twente zijn we bezig met Ambient Intelligence. Bij Ambient Intelligence krijgt de gebruiker real-time gegevens over zijn omgeving. Met de applicatie die we nu aan het bouwen zijn, kan een onderhoudsmonteur in een fabriek, terwijl hij kijkt naar een machine, tegelijk de onderhoudsinstructies van die machine zien en direct de juiste documentatie en handleidingen oproepen. In november wordt dit systeem op een beurs gepresenteerd. Via dezelfde interface kan het onderhoud geregistreerd worden, mede daardoor verwacht ik dat dit binnenkort gemeengoed zal zijn vooral in omgevingen waar procedures belangrijk zijn, zoals in de voedingsmiddelenindustrie. Met een zorginstelling zijn we nog een andere toepassing aan het onderzoeken waarbij patiënten virtueel in een vertrouwde omgeving geplaatst worden om ze gerust te stellen.</p><p>In toekomstige blogs zal ik jullie op de hoogte houden van de resultaten op beide terreinen.</p><h2>Nawoord:</h2><p>Ik heb gisteren nog even bij een bevriend bedrijf met de HTC-Vive mogen spelen. Ik moet bekennen dat ik dat veel leuker vind. Je hebt een grotere ruimte waarbinnen je kunt bewegen en je hebt twee losse controllers (in iedere hand één) wat veel natuurlijker werkt dan de ene X-box controller die bij de Oculus zit. Oculus maakt wel reclame met soortgelijke controllers, maar die zijn op dit moment niet leverbaar. Kwaliteit van het beeld en het draaggemak is verder hetzelfde. Voordeel van de Oculus is dat die wat makkelijker mee te nemen is.</p><h2>Alleen voor de nerds:</h2><p>Alleen de Oculus is niet voldoende, je hebt een PC nodig met een heel dikke grafische kaart. Wij hebben hier bij Innovadis aardig wat staanaan computers, maar toch hebben we speciaal voor de Oculus een nieuwe PC moeten samenstellen: GeForce GTX1070, i5-6600K, 16GB DDR4 en een 480GB SSD-HD. Daar draait het prima op. We hebben overwogen een i7 in plaats van de i5 te gebruiken maar dat schijnt voor de grafische prestaties niet uit te maken.</p>",
        "blogType": "smart-industry",
        "lead": "inleiding hier",
        "title": "Dit is een titel",
        "heroImage": "https://image.headless.rest/resized/innovadis/vr/0.jpg"
      }
    },
    "created": "2017-09-21T08:43:00.100Z",
    "updated": "2017-09-22T11:35:34.774Z"
  },
  {
    "content": {
      "nl": {
        "author": "Tom Heinen",
        "publish_date": "2017-09-20T22:00:00.000Z",
        "body": "<p>Een onderwerp welke veel terugkomt in het nieuws is de mate van veiligheid die te garanderen is op het internet. Feit is dat veiligheid op het internet niet vanzelfsprekend is, je moet zelf stappen ondernemen om je website zonder gevaar aan de buitenwereld te tonen. Vooral bij webshops of andere omgevingen waarin men persoonlijke informatie achter laat, is het erg belangrijk dat je een veiligheidscertificaat gebruikt.</p><p><br></p><p>In augustus 2014 kondigde Google aan dat het gebruik van https voordeel zou gaan opleveren op de posities in Google. Daarnaast is het vanaf 1 januari 2016 wettelijk verplicht om datalekken te melden. Laat je als organisatie data&nbsp;lekken of verwerk je persoonsgegevens zonder je&nbsp;aan de wet te houden dan loop je als organisatie kans op een boete. Deze boetes zijn niet misselijk en kunnen per overtreding oplopen tot € 820.000,- of 10% van de jaaromzet. Een van de mogelijkheden om je te beschermen als organisatie is het gebruik van een veiligheidscertificaat.&nbsp;</p><p>Wat is https</p><p>Https staat voor HyperText Transfer Protocol Secure. Het doel van https is het veilig uitwisseling van gegevens.&nbsp;Door gebruik te maken van een https verbinding worden de gegevens welke via het internet verstuurd worden beveiligd. Voor een buitenstaander zou het daardoor onmogelijk moeten zijn om de gegevens welke verstuurd worden af te luisteren.</p><p>Waarom https</p><p>De belangrijkste reden om je gehele site over te zetten op https is ter beveiliging van de gegevens die van en naar je website worden verzonden (denk bijvoorbeeld aan contactformulieren en alle klantinformatie die geregistreerd is). Daarnaast levert het nu ook voordeel op voor je posities in Google. Uit eerste onderzoeken welke gedaan zijn blijkt dit daadwerkelijk het geval te zijn. Ga je niet over op het volledig draaien van je website op https dan zal je hierin in de toekomst zeker nadelige gevolgen van ondervinden op je posities in de zoekmachines.</p><p>Soorten certificaten</p><p>Grofweg is er&nbsp;de keuze uit een tweetal beveiligingsprotocollen: het standaard SSL protocol (SSL) en het Extended&nbsp;Validation SSL protocol (EV SSL). In het vervolg van deze blog&nbsp;beschrijven we de belangrijkste verschillen tussen deze protocollen en het&nbsp;proces dat moet worden doorlopen om een optimaal veilige verbinding voor je&nbsp;website te garanderen. Ook geven we&nbsp;een&nbsp;aantal voorbeelden van de protocollen in werking. Binnen de EV SSL en de standaard SSL zitten ook een aantal&nbsp;variaties. Die behandelen we verder niet in dit blog artikel.</p><p>Standaard SSL vergeleken met EV SSL</p><p>Groot verschil tussen het ‘standaard’ SSL protocol en het EV SSL protocol is het gemak waarmee een gebruiker inzicht&nbsp;heeft in de kwaliteit van de beweerde beveiliging op een website. Bij een standaard protocol zal een gebruiker een aantal&nbsp;stappen moet zetten alvorens er naar voren komt door wie en op welke manier de website beveiligd wordt en of er sprake is van&nbsp;een betrouwbaar certificaat. Het EV SSL zorgt ervoor dat in één oogopslag kan worden gezien of er sprake is van een&nbsp;betrouwbare website.</p><p>De eigenschappen die EV SSL onderscheiden van een standaardprotocol op een rijtje:</p><p>De adresbalk wordt groen in de populairste browsers, waardoor meteen duidelijk is of er sprake is van een goed beveiligde&nbsp;website.</p><p>De identiteit van de eigenaar van de website wordt duidelijk getoond.</p><p>De naam van de organisatie die het certificaat heeft uitgegeven wordt duidelijk getoond.</p><p>Dankzij een EV SSL protocol is het voor bezoekers bij het groen worden van de browserbalk meteen duidelijk dat:</p><p>Het inderdaad om de website van de verwachte organisatie gaat;</p><p>Er geen sprake is van een gekopieerde website, met mogelijk verkeerde bedoelingen;</p><p>Er vertrouwelijk met gegevens om wordt gegaan;</p><p>Er met gerust hart een bestelling of betaling op de website gedaan kan worden;</p><p>Heeft een website een&nbsp;EV SSL?</p><p>Op de site van grootbanken als Rabobank, ABN en ING, is goed te zien hoe helder de presentatie van het EV SSL protocol is. Naast het&nbsp;webadres wordt het onderstaande blok in het groen weergegeven. Het slotje en de groene balk tonen onmiddellijk aan dat er&nbsp;sprake is van een betrouwbare website.</p><p><br></p><p>Mocht er nog enige twijfel bestaan over de geldigheid van het certificaat, dan wordt met een enkele klik op deze balk&nbsp;duidelijkheid gegeven.</p><p><br></p><p>Bij het gebruik van een standaard SSL protocol moet de bezoeker controleren of er sprake is van een webadres dat begint&nbsp;met https:// en of er een slotje voor het webadres staat. Na klikken op het slotje wordt een webadres getoond dat moet&nbsp;worden vergeleken met het adres dat in de browserbalk staat. Er is dus sprake van een drietal stappen, waarbij de laatste&nbsp;stap ook ruimte voor fouten laat, wat de veiligheidsgarantie toch minder sterk maakt. Het EV SSL protocol neemt deze&nbsp;stappen weg en garandeert een probleemloos en veilig websitebezoek.&nbsp;Verder maakt het standaard SSL protocol geen gebruik van een gestandaardiseerde controleprocedure, om te beoordelen of&nbsp;een bedrijf echt bestaat en de website daadwerkelijk beheert. De kwaliteit van de controles kan dus niet gegarandeerd&nbsp;worden.&nbsp;&nbsp;</p><p>Garantie verschillen</p><p>Bij het uitgeven van een certificaat garandeert de uitgever van het certificaat de identiteit van de server en eigenaar. Mocht&nbsp;het zo zijn dat je&nbsp;certificaat wordt uitgegeven aan een onbevoegde organisatie dan kun&nbsp;je&nbsp;de aantoonbare schade claimen&nbsp;bij de uitgever van het certificaat. Het verzekerde bedrag bij een SSL EV is over het algemeen twee tot drie keer zo hoog als&nbsp;bij een standaard SSL.</p><p>Procedure bij protocolimplementatie</p><p>Er moeten enkele stappen worden doorlopen alvorens een (EV) SSL protocol kan worden ingezet. Daarom is het verstandig&nbsp;alvast de benodigde informatie bij elkaar te zoeken voordat begonnen wordt aan de aanvraagprocedure.&nbsp;</p><p>SSL-certificaat aanvraagprocedure</p><p>Er komt vrij veel papierwerk aan te pas bij het integreren van het protocol, begin dus tijdig met het bij elkaar krijgen van de&nbsp;informatie!</p><p>Organisatiegegevens (uit KvK-uittreksel handelsregister)*</p><p>E-mail adres van de contactpersoon of aanvrager</p><p>Gegevens van de bevoegde aanvrager(s)</p><p>Gegevens van de Certificaatbeheerder(s)</p><p>Kopieën van geldige legitimatiebewijzen van de bevoegde aanvrager(s) en certificaatbeheerder(s)*</p><p>De&nbsp;domeinna(a)m(en) (URL’s) van de server(s) die je wilt&nbsp;gaat beveiligen</p><p>Bewijs van registratie van het domein op naam van je&nbsp;organisatie of een Akkoordverklaring Domein Gebruik</p><p>Document(en) waaruit de bevoegdheid van de aanvrager(s) blijkt</p><p>Origineel getekend aanvraagformulier</p><p>* Alleen voor EV SSL</p><p>Let op:</p><p>De Aanvrager is de persoon die officieel bevoegd is om de organisatie extern te vertegenwoordigen.</p><p>De Certificaatbeheerder is de persoon die het certificaat beheert en op je server installeert.</p><p>Het toevoegen van een veiligheidscertificaat is niet de heilige graag bij het voorkomen van datalekken. Je dient als organisatie&nbsp;preventief de juiste beveiligingsmaatregelen nemen om datalekken te voorkomen. Bijkomend voordeel is echter wel dat een veiligheidsprotocol een positieve bijdrage zal leveren aan je Google posities.</p><p>Vragen?</p><p>Ik hoop met deze blog wat meer duidelijkheid hebben kunnen verschaffen in veiligheidscertificaten&nbsp;en welke je moet kiezen. Heb je nog een vraag of kom je&nbsp;er niet, welk certificaat je moet kiezen, dan hoor ik het graag.&nbsp;</p><p><br></p>",
        "blogType": "smart-industry",
        "title": "Dit is een titel",
        "heroImage": "https://image.headless.rest/resized/innovadis/security/0.jpg"
      }
    },
    "created": "2017-09-21T08:46:01.303Z",
    "updated": "2017-09-21T09:41:02.863Z"
  }
]