[
  {
    "content": {
      "nl": {
        "tags": [
          "smart-industry",
          "virtual-reality"
        ],
        "author": "Jurgen van Kreij",
        "publish_date": "2017-09-22T22:00:00.000Z",
        "body": "<p>Je kunt volledig rond kijken waarbij het beeld perfect meebeweegt, maar ook wanneer je opzij stapt en dichterbij buigt gaat het beeld realistisch mee. Je bent, zodra je de bril opzet, echt in een andere wereld! Op dit moment zijn er twee soorten applicaties: in de echte wereld opgenomen reportages waar je als toeschouwer kunt rond kijken. JauntVR is hier goed in en heeft daar ook speciale 360-graden camera’s voor gemaakt. En volledig virtuele werelden waarin je kunt rondlopen, dat zijn meestal de spellen en simulaties en zelf actief kunt zijn.</p><p>Kom gerust een keer langs om het te ervaren.</p><p><br></p><h2>Toepassingen?</h2><p>We zijn aan het experimenteren met toepassingen. Toepassingen waar wij aan denken zijn visualisatie van complexe data of een virtuele control room. In samenwerking met de Universiteit Twente zijn we bezig met Ambient Intelligence. Bij Ambient Intelligence krijgt de gebruiker real-time gegevens over zijn omgeving. Met de applicatie die we nu aan het bouwen zijn, kan een onderhoudsmonteur in een fabriek, terwijl hij kijkt naar een machine, tegelijk de onderhoudsinstructies van die machine zien en direct de juiste documentatie en handleidingen oproepen. In november wordt dit systeem op een beurs gepresenteerd. Via dezelfde interface kan het onderhoud geregistreerd worden, mede daardoor verwacht ik dat dit binnenkort gemeengoed zal zijn vooral in omgevingen waar procedures belangrijk zijn, zoals in de voedingsmiddelenindustrie. Met een zorginstelling zijn we nog een andere toepassing aan het onderzoeken waarbij patiënten virtueel in een vertrouwde omgeving geplaatst worden om ze gerust te stellen.</p><p>In toekomstige blogs zal ik jullie op de hoogte houden van de resultaten op beide terreinen.</p><p><br></p><h2>Nawoord:</h2><p>Ik heb gisteren nog even bij een bevriend bedrijf met de HTC-Vive mogen spelen. Ik moet bekennen dat ik dat veel leuker vind. Je hebt een grotere ruimte waarbinnen je kunt bewegen en je hebt twee losse controllers (in iedere hand één) wat veel natuurlijker werkt dan de ene X-box controller die bij de Oculus zit. Oculus maakt wel reclame met soortgelijke controllers, maar die zijn op dit moment niet leverbaar. Kwaliteit van het beeld en het draaggemak is verder hetzelfde. Voordeel van de Oculus is dat die wat makkelijker mee te nemen is.</p><p><br></p><h2>Alleen voor de nerds:</h2><p>Alleen de Oculus is niet voldoende, je hebt een PC nodig met een heel dikke grafische kaart. Wij hebben hier bij Innovadis aardig wat staanaan computers, maar toch hebben we speciaal voor de Oculus een nieuwe PC moeten samenstellen: GeForce GTX1070, i5-6600K, 16GB DDR4 en een 480GB SSD-HD. Daar draait het prima op. We hebben overwogen een i7 in plaats van de i5 te gebruiken maar dat schijnt voor de grafische prestaties niet uit te maken.</p>",
        "blogType": "smart-industry",
        "lead": "Wij hebben sinds enkele weken de nieuwste Oculus Rift op kantoor. Ik ben enorm onder de indruk van de Virtual Reality ervaring. We hebben eerder al geëxperimenteerd met de voorzetbrillen waar een telefoon in gaat (Homido, Oculus VR en Google Cardboard) maar dit is echt mindblowing.",
        "title": "Innovadis en virtual reality",
        "heroImage": "https://image.headless.rest/resized/innovadis/vr/0.jpg"
      }
    },
    "created": "2017-09-21T08:43:00.100Z",
    "updated": "2017-09-23T15:06:03.640Z"
  },
  {
    "content": {
      "nl": {
        "tags": [
          "security"
        ],
        "author": "Tom Heinen",
        "publish_date": "2017-09-22T22:00:00.000Z",
        "body": "<p>In augustus 2014 kondigde Google aan dat het gebruik van https voordeel zou gaan opleveren op de posities in Google. Daarnaast is het vanaf 1 januari 2016 wettelijk verplicht om datalekken te melden. Laat je als organisatie data&nbsp;lekken of verwerk je persoonsgegevens zonder je&nbsp;aan de wet te houden dan loop je als organisatie kans op een boete. Deze boetes zijn niet misselijk en kunnen per overtreding oplopen tot € 820.000,- of 10% van de jaaromzet. Een van de mogelijkheden om je te beschermen als organisatie is het gebruik van een veiligheidscertificaat.&nbsp;</p><p><br></p><h2>Wat is https</h2><p>Https staat voor HyperText Transfer Protocol Secure. Het doel van https is het veilig uitwisseling van gegevens.&nbsp;Door gebruik te maken van een https verbinding worden de gegevens welke via het internet verstuurd worden beveiligd. Voor een buitenstaander zou het daardoor onmogelijk moeten zijn om de gegevens welke verstuurd worden af te luisteren.</p><p><br></p><h2>Waarom https</h2><p>De belangrijkste reden om je gehele site over te zetten op https is ter beveiliging van de gegevens die van en naar je website worden verzonden (denk bijvoorbeeld aan contactformulieren en alle klantinformatie die geregistreerd is). Daarnaast levert het nu ook voordeel op voor je posities in Google. Uit eerste onderzoeken welke gedaan zijn blijkt dit daadwerkelijk het geval te zijn. Ga je niet over op het volledig draaien van je website op https dan zal je hierin in de toekomst zeker nadelige gevolgen van ondervinden op je posities in de zoekmachines.</p><p><br></p><h2>Soorten certificaten</h2><p>Grofweg is er&nbsp;de keuze uit een tweetal beveiligingsprotocollen: het standaard SSL protocol (SSL) en het Extended&nbsp;Validation SSL protocol (EV SSL). In het vervolg van deze blog&nbsp;beschrijven we de belangrijkste verschillen tussen deze protocollen en het&nbsp;proces dat moet worden doorlopen om een optimaal veilige verbinding voor je&nbsp;website te garanderen. Ook geven we&nbsp;een&nbsp;aantal voorbeelden van de protocollen in werking. Binnen de EV SSL en de standaard SSL zitten ook een aantal&nbsp;variaties. Die behandelen we verder niet in dit blog artikel.</p><p><br></p><h2>Standaard SSL vergeleken met EV SSL</h2><p>Groot verschil tussen het ‘standaard’ SSL protocol en het EV SSL protocol is het gemak waarmee een gebruiker inzicht&nbsp;heeft in de kwaliteit van de beweerde beveiliging op een website. Bij een standaard protocol zal een gebruiker een aantal&nbsp;stappen moet zetten alvorens er naar voren komt door wie en op welke manier de website beveiligd wordt en of er sprake is van&nbsp;een betrouwbaar certificaat. Het EV SSL zorgt ervoor dat in één oogopslag kan worden gezien of er sprake is van een&nbsp;betrouwbare website.</p><p>De eigenschappen die EV SSL onderscheiden van een standaardprotocol op een rijtje:</p><ul><li>De adresbalk wordt groen in de populairste browsers, waardoor meteen duidelijk is of er sprake is van een goed beveiligde&nbsp;website.</li><li>De identiteit van de eigenaar van de website wordt duidelijk getoond.</li><li>De naam van de organisatie die het certificaat heeft uitgegeven wordt duidelijk getoond.</li></ul><p>Dankzij een EV SSL protocol is het voor bezoekers bij het groen worden van de browserbalk meteen duidelijk dat:</p><ul><li>Het inderdaad om de website van de verwachte organisatie gaat;</li><li>Er geen sprake is van een gekopieerde website, met mogelijk verkeerde bedoelingen;</li><li>Er vertrouwelijk met gegevens om wordt gegaan;</li><li>Er met gerust hart een bestelling of betaling op de website gedaan kan worden;</li></ul><p><br></p><h2>Heeft een website een&nbsp;EV SSL?</h2><p>Op de site van grootbanken als Rabobank, ABN en ING, is goed te zien hoe helder de presentatie van het EV SSL protocol is. Naast het&nbsp;webadres wordt het onderstaande blok in het groen weergegeven. Het slotje en de groene balk tonen onmiddellijk aan dat er&nbsp;sprake is van een betrouwbare website.</p><p><img src=\"https://www.innovadis.com/media/1123/bankenurl.jpg?width=500&amp;height=21.428571428571427\"></p><p>Mocht er nog enige twijfel bestaan over de geldigheid van het certificaat, dan wordt met een enkele klik op deze balk&nbsp;duidelijkheid gegeven.</p><p><img src=\"https://www.innovadis.com/media/1124/detailcertificaating.jpg?width=500&amp;height=171.93195625759418\"></p><p>Bij het gebruik van een standaard SSL protocol moet de bezoeker controleren of er sprake is van een webadres dat begint&nbsp;met https:// en of er een slotje voor het webadres staat. Na klikken op het slotje wordt een webadres getoond dat moet&nbsp;worden vergeleken met het adres dat in de browserbalk staat. Er is dus sprake van een drietal stappen, waarbij de laatste&nbsp;stap ook ruimte voor fouten laat, wat de veiligheidsgarantie toch minder sterk maakt. Het EV SSL protocol neemt deze&nbsp;stappen weg en garandeert een probleemloos en veilig websitebezoek.&nbsp;Verder maakt het standaard SSL protocol geen gebruik van een gestandaardiseerde controleprocedure, om te beoordelen of&nbsp;een bedrijf echt bestaat en de website daadwerkelijk beheert. De kwaliteit van de controles kan dus niet gegarandeerd&nbsp;worden.&nbsp;&nbsp;</p><p><br></p><h2>Garantie verschillen</h2><p>Bij het uitgeven van een certificaat garandeert de uitgever van het certificaat de identiteit van de server en eigenaar. Mocht&nbsp;het zo zijn dat je&nbsp;certificaat wordt uitgegeven aan een onbevoegde organisatie dan kun&nbsp;je&nbsp;de aantoonbare schade claimen&nbsp;bij de uitgever van het certificaat. Het verzekerde bedrag bij een SSL EV is over het algemeen twee tot drie keer zo hoog als&nbsp;bij een standaard SSL.</p><p><br></p><h2>Procedure bij protocolimplementatie</h2><p>Er moeten enkele stappen worden doorlopen alvorens een (EV) SSL protocol kan worden ingezet. Daarom is het verstandig&nbsp;alvast de benodigde informatie bij elkaar te zoeken voordat begonnen wordt aan de aanvraagprocedure.&nbsp;</p><p><br></p><h2>SSL-certificaat aanvraagprocedure</h2><p>Er komt vrij veel papierwerk aan te pas bij het integreren van het protocol, begin dus tijdig met het bij elkaar krijgen van de&nbsp;informatie!</p><ul><li>Organisatiegegevens (uit KvK-uittreksel handelsregister)*</li><li>E-mail adres van de contactpersoon of aanvrager</li><li>Gegevens van de bevoegde aanvrager(s)</li><li>Gegevens van de Certificaatbeheerder(s)</li><li>Kopieën van geldige legitimatiebewijzen van de bevoegde aanvrager(s) en certificaatbeheerder(s)*</li><li>De&nbsp;domeinna(a)m(en) (URL’s) van de server(s) die je wilt&nbsp;gaat beveiligen</li><li>Bewijs van registratie van het domein op naam van je&nbsp;organisatie of een Akkoordverklaring Domein Gebruik</li><li>Document(en) waaruit de bevoegdheid van de aanvrager(s) blijkt</li><li>Origineel getekend aanvraagformulier</li></ul><p>* Alleen voor EV SSL</p><p><br></p><p>Let op:</p><ul><li>De Aanvrager is de persoon die officieel bevoegd is om de organisatie extern te vertegenwoordigen.</li><li>De Certificaatbeheerder is de persoon die het certificaat beheert en op je server installeert.</li></ul><p><br></p><p>Het toevoegen van een veiligheidscertificaat is niet de heilige graag bij het voorkomen van datalekken. Je dient als organisatie&nbsp;preventief de juiste beveiligingsmaatregelen nemen om datalekken te voorkomen. Bijkomend voordeel is echter wel dat een veiligheidsprotocol een positieve bijdrage zal leveren aan je Google posities.</p><p><br></p><h2>Vragen?</h2><p>Ik hoop met deze blog wat meer duidelijkheid hebben kunnen verschaffen in veiligheidscertificaten&nbsp;en welke je moet kiezen. Heb je nog een vraag of kom je&nbsp;er niet, welk certificaat je moet kiezen, dan hoor ik het graag.&nbsp;</p>",
        "blogType": "smart-industry",
        "lead": "Een onderwerp welke veel terugkomt in het nieuws is de mate van veiligheid die te garanderen is op het internet. Feit is dat veiligheid op het internet niet vanzelfsprekend is, je moet zelf stappen ondernemen om je website zonder gevaar aan de buitenwereld te tonen. Vooral bij webshops of andere omgevingen waarin men persoonlijke informatie achter laat, is het erg belangrijk dat je een veiligheidscertificaat gebruikt.",
        "title": "Waarom een veiligheidscertificaat en welke moet ik kiezen?",
        "heroImage": "https://image.headless.rest/resized/innovadis/security/0.jpg"
      }
    },
    "created": "2017-09-21T08:46:01.303Z",
    "updated": "2017-09-23T15:04:15.169Z"
  },
  {
    "content": {
      "nl": {
        "tags": [
          "smart-health"
        ],
        "author": "André van der Zijden",
        "publish_date": "2017-10-09T22:00:00.000Z",
        "body": "<h3>Grote schoonmaak</h3><p>Het is weer zo ver. Het hele huis is een grote puinhoop. Morgen staat de familie op de stoep en we moeten gaan schoonmaken. Jij en je partner staan voor deze uitdaging. Omdat jullie beide in de ICT werkzaam zijn vragen jullie je af hoeveel story points dit werk eigenlijk is.</p><p><strong>Goede vraag!</strong>&nbsp;Niet de meest voor de hand liggende, maar dat vergeef ik je. Dit is misschien een metafoor die behoorlijk goed aansluit bij de werkelijkheid omdat ik vaak teams tegenkom die story points gebruiken maar niet precies weten waarom ze dat doen. In het voorbeeld lijkt het heel erg vreemd, maar als we het hebben over ICT projecten dan vinden we het wel normaal.&nbsp;</p><h3>Wat zijn story points?</h3><p>Je gebruikt story points om werk in te schatten op omvang. Dit hoeven trouwens niet perse story points te zijn (dit gaat er vanuit dat je werk bestaat uit het realiseren van user stories), maar worden ook&nbsp;Gummy Bears of&nbsp;Nebulous Units of Time (NUTs) genoemd, in ons geval zouden we het schoonmaakpunten kunnen noemen.</p><p>De omvang van iets&nbsp;wordt&nbsp;beïnvloed&nbsp;door een aantal zaken (ongeacht waarin je schat):</p><p>1.&nbsp;<strong><em>De inspanning van het werk</em></strong>. Als je een grote kamer moet schoonmaken ben je langer bezig dan met een kleine kamer. De ene taak kan bewerkelijker zijn dan de ander, bijvoorbeeld stofzuigen of de ramen lappen.</p><p>2.&nbsp;<strong><em>De complexiteit van het werk</em></strong>. Indien de taak die je moet uitvoeren complexer is kan dit van invloed zijn op je inschatting. Als je tijdens het stofzuigen een liedje moet zingen dan maakt dat de taak complexer, het&nbsp;beïnvloed&nbsp;de omvang wellicht niet. Als je moet stofzuigen in een ruimte waarin veel meubelen&nbsp;staan, dan is dat complexer omdat je die meubels moet verplaatsen, dat&nbsp;beïnvloed&nbsp;de tijd dat je aan het&nbsp;stofzuigen bent en dus de omvang.</p><p>3.&nbsp;<strong><em>Eventuele risico's en onduidelijkheden van het werk</em></strong>. Wanneer&nbsp;je niet precies weet wat je gaat doen, er is een kamer in het huis waar je nog nooit bent geweest, dan houd je er sneller rekening mee dat het lastiger is. Als je de woonkamer gaat stofzuigen, maar je weet dat de stofzakken bijna op zijn dan wil je in je inschatting wellicht rekening houden met het feit dat je nieuwe moet kopen. Je zou ook rekening kunnen houden met het risico dat je nergens die stofzakken kan krijgen, maar bij risico's moet je als schatter bepalen of het risico groot genoeg is om mee te nemen in je inschatting. Het is&nbsp;echter onverstandig om een&nbsp;risico dat behoorlijk groot is, totaal niet mee te nemen in de inschatting.</p><p>Schoonmaakpunten (of story points) zijn een eenheid voor omvang, maar ook alleen voor de omvang. De woonkamer met 8 schoonmaakpunten is&nbsp;qua schoonmaken behoorlijk wat werk. De slaapkamer met 2 schoonmaakpunten is een stuk minder omvangrijk en vier keer zo klein dan de woonkamer.&nbsp;</p><h3>Wat heb je er aan?</h3><p>Stel je hebt je gehele huis ingeschat op schoonmaakpunten, wat dan? Dan weet je wellicht dat het gehele huis schoonmaken 42 punten is, of dat de benedenverdieping 24 punten is. Naast de omvang heb je een beeld nodig van de snelheid. De combinatie geeft je een idee over wanneer je iets afrond. Dit is ook van toepassing op story points en andere projecten, zonder de snelheid zijn de punten waardeloos. Door story points te gebruiken in een iteratief werkproces, zoals Scrum, kan je een beeld vormen van het aantal story points dat je per iteratie (of sprint in Scrum) kan verwerken. Dit wordt ook wel velocity genoemd.</p><h3>Waarom dan toch schoonmaakpunten?</h3><p>Er zijn meerdere voordelen aan aparte eenheid voor omvang. Ik zal er een aantal op een rij zetten:</p><p>1. Een aparte eenheid van omvang zorgt er voor dat je een&nbsp;<strong><em>gezamenlijke inschatting</em></strong>&nbsp;kan maken. Als je in uren schat dan heb je het altijd over een eigen inschatting omdat uren ook iets zeggen over doorlooptijd. Omdat schoonmaakpunten puur over omvang gaan kan je dit gezamenlijk doen. Dit is een nuttig voordeel als je in een team samenwerkt en je van te voren niet exact kan bepalen wie wat gaat oppakken.</p><p>2. Stel je werkt in vaste iteraties (want je bent Agile), dan besteed je altijd rond hetzelfde aantal uren in die iteratie. Echter de verbeteringen in je werkwijze en techniek zullen er niet toe leiden dat je minder uren gaat besteden, het gaat er toe leiden dat je meer waarde gaat opleveren (hogere kwaliteit, meer functionaliteit). Met schoonmaakpunten kan je daarom&nbsp;<strong><em>zien of je aanpassingen zin hebben</em></strong>, want de omvang van het werk zal niet veranderen.</p><h3>Waar moet je rekening mee houden met schoonmaakpunten?</h3><p>Ondanks dat schoonmaakpunten heel nuttig zijn en een aantal voordelen opleveren voor je schoonmaakteam zijn er een aantal standaard misvattingen. Houd hier rekening mee als je schoonmaakpunten gaat gebruiken.</p><p>1. Schoonmaakpunten zijn een eenheid voor omvang. In tegenstelling tot gewicht of afstand kan je werk&nbsp;<strong><em>niet meten</em></strong>. Dit is niet anders dan met uren, natuurlijk is er een bepaalde tijd besteed aan een stuk werk, maar dat wil niet zeggen dat dit de volgende keer weer zo is, als technieken zijn veranderd of als er andere mensen mee bezig gaan. Dit betekent dus ook dat de punten gelden voor de persoon of personen die de inschatting&nbsp;maken. Een ander persoon of team zal niet direct op basis van deze punten weten hoe groot het werk is.</p><p>2. Omdat de punten gebonden zijn aan diegene die ze geschat heeft kan je punten niet vergelijken. Het is&nbsp;<strong><em>niet</em></strong><em>&nbsp;</em>verstandig om te kijken wie het snelste is door velocity van verschillende teams met elkaar te&nbsp;<strong><em>vergelijken</em></strong>. Dit staat los van het feit dat snelheid in een race heel belangrijk is, maar de winnaar nog steeds diegene is die als eerste over de streep komt. In het geval van projecten geldt dat het team dat de meeste waarde oplevert (ongeacht zijn velocity) belangrijker is voor een organisatie.</p><p>3. Omdat punten een abstract begrip zijn (want je kan het niet meten), is het&nbsp;<strong><em>niet voor iedereen&nbsp;gemakkelijk te bevatten</em></strong>. Deze blog post is an sich niet zo lang en dus kan je stellen dat het principe niet heel erg complex is, maar je moet er rekening mee houden dat er mensen in een team kunnen zijn die het niet direct begrijpen. Wat snel gebeurt is dat mensen teruggrijpen naar iets wat ze wel kennen, namelijk uren. Het is niet erg dat mensen denken in uren om de inspanning en daarmee de omvang te bepalen. Als zij weten dat item X 4 uur kost en item Y 8 uur kost dan weten ze dat Y twee keer zo groot moet zijn dan X. Stel dat&nbsp;een ander teamlid denkt dat X 2 uur kost en Y 6 uur dan is dat ook prima, dat is een verschil van inzicht. Je wilt dan de discussie voeren over dat de een denkt dat het werk 3 keer zo groot is terwijl iemand anders denkt dat het werk 2 keer zo groot is. Wat je niet wilt is de discussie voeren of het nou 6 of 8 uur in beslag neemt, want dat kan daadwerkelijk verschillen per persoon.&nbsp;</p><h3>Vragen?</h3><p>Ik hoop dat ik met deze blog meer duidelijkheid heb gegeven over wat Story Points, Gummy bears of Nebulous Units of Time (NUTs) zijn. Ik vind het leuk om meer inzicht te verschaffen over Agile practices of tactieken. Heb je nog een vraag over story points of over een ander Agile aspect, tactiek of framework dan hoor ik het graag, dan geef ik er in een toekomstige blog antwoord op.</p>",
        "blogType": "smart-health",
        "lead": "Als je in aanraking bent geweest met Scrum of XP dan is de kans groot dat je het begrip story points kent. De kans is dan ook aanwezig dat niet goed is uitgelegd wat ze zijn en waarom je ze gebruikt. In deze post leg ik uit wat story points zijn en hoe je ze goed kan gebruiken.",
        "title": "Wat zijn story points en wat heb ik er aan?",
        "heroImage": "https://image.headless.rest/resized/innovadis/story-points/0.jpg"
      }
    },
    "created": "2017-10-09T12:22:49.176Z",
    "updated": "2017-10-10T10:03:33.586Z"
  }
]