[
  {
    "content": {
      "nl": {
        "tags": [],
        "author": "Jordy Goorman",
        "video": null,
        "bottomText": null,
        "bottomTitle": null,
        "program": [],
        "programLead": null,
        "body": "<p>Smart Industry</p><p>Het seminar werd afgetrapt door Peter Langela van Novel-T. Hij legde op een verfrissende manier uit wat Smart Industry precies inhoudt. Smart Industry heeft alles te maken met Industry 4.0. Dit getal staat voor de verschillende industriële revoluties, wat natuurlijk begonnen is bij Industry 1.0 (machines). Dit veranderde naar Industry 2.0 (massaproductie) en later werd de transitie gemaakt naar automatisering (Industry 3.0).&nbsp; De wereld is nu op het punt gekomen dat de manier van produceren opnieuw op revolutionaire wijze veranderd. De integratie van data, Internet of Things&nbsp; (IoT), cloud computing en andere technologische ontwikkelingen veranderen de kern van de productie en de productiesystemen. Dit wordt bedoeld met het begrip Industry 4.0. Peter legde uit dat het van groot belang is dat organisaties hier in mee gaan, omdat anders hun concurrentiepositie verslechterd kan worden.</p><p>Adoptie van Smart Industry</p><p>Vervolgens presenteerde Dewi Moester de resultaten van haar scriptie over de adoptie van Smart Industry in Nederland. Met behulp van het Technology Acceptance Model van Davis et al. (1989) heeft ze een enquête opgesteld welke ze verspreid heeft onder decision-makers in de maakindustrie. Hieruit blijkt dat het merendeel van de ondervraagden budget heeft vrijgemaakt voor investeringen voor Smart Industry. Qua implementatie bleek dat het merendeel van de respondenten nog niet hun industrie ‘smart’ heeft gemaakt, maar vooral nog in de research fase zit om zo te kunnen onderzoeken wat de mogelijkheden voor hun&nbsp; bedrijf zijn. De grootste uitdaging bij implementatie zit in het gebrek aan kennis en skills in het bedrijf. Ook het hoge investeringsbedrag in de technologie wordt als een uitdaging gezien, evenals het verhoogde cyber risico en protectie van dat. Bovendien twijfelt ongeveer 1/3 over de&nbsp; ROI van de implementatie van Smart Industry.</p><p>Apollo Vredestein en Smart Industry</p><p>Dewi werd opgevolgd door Jos Wesselink,&nbsp; IT manager bij Apollo Vredestein. Hij vertelde hoe Apollo Vredestein hun bedrijf ‘smarter’ heeft gemaakt door procesoptimalisatie waarbij het eindproduct tracable wordt tijdens het productieproces. Ook experimenteert het bedrijf met het plaatsen van RFID tags in de banden. Dat biedt interessante mogelijkheden voor bandenbedrijven Wanneer deze data gekoppeld wordt aan bijvoorbeeld aantal daadwerkelijke kilometers komt er een extra set aan interessante klant- en onderzoekdata vrij.</p><p>Progloves</p><p>Daarna was het tijd voor Paul Gunther van Progloves, die helemaal vanuit München naar het seminar is gekomen. Progloves heeft de eerste smart glove voor de industrie uitgevonden. Deze smart glove helpt werknemers bij het verminderen van de administratieve rompslomp die komt kijken bij de werkzaamheden in de fabriek. Door het scannen van bijvoorbeeld een barcode kan de smart glove helpen bij o.a. order picking, track en tracing en assemblage. Hierdoor gaat de productiviteit omhoog en besparen bedrijven geld. Een concrete toepassing voor nu met SMART mogelijkheden voor later (bijvoorbeeld bewegingskunde, fysieke gesteldheid etc.</p><p>Inzet big data</p><p>De laatste presentatie voor de pauze werd gegeven door Peter Hoekstra van Datacadabra. Zijn presentatie ging over de oneindige mogelijkheden van big data. Dit liet Peter zien door te vertellen over de mogelijkheden die big data in bijvoorbeeld voetbal heeft. Hij benadrukte dat er tegenwoordig heel erg veel mogelijk is met big data, echter maken veel bedrijven hier nog geen gebruik van. Mocht een bedrijf hier mee beginnen, dan is het wel belangrijk dat de menselijke factor van big data wordt meegenomen: door menselijk inzicht en kunde wordt data ‘vertaald’ en echt relevant.</p><p>Minder machinestoringen en menselijke fouten</p><p>Na de pauze vertelde Jurgen van Kreij het verhaal van Tip4Support. Het doel van Tip4Support is om er voor te zorgen dat productielijnen minder vaak stilstaan door machinestoringen en menselijke fouten. De monteur op de werkvloer krijgt een tablet waarmee hij precies de machines kan zien die een check of onderhoud nodig hebben. De tablet heeft een koppeling met het onderhoudssysteem, maar ook met het documentatie systeem. Hiermee kan de monteur meteen opzoeken hoe een machine bijvoorbeeld gemaakt moet worden. Als het apparaat gecheckt of gemonteerd is, wordt dit doorgestuurd naar de planner. Dit scheelt veel tijd, want er gaat minder tijd verloren aan papier- en opzoekwerk. Bovendien is het tevens de directe en actuele plattegrond: zoekwerk naar machine en/of onderdeel behoort tot het verleden!</p><p>Marketing in een smart omgeving</p><p>Stan Bergenhenegouwen van Pentair vertelde over de digitale transitie die Pentair heeft ondergaan. Pentair is een echt B2B bedrijf en haalde veel leads op uit beurzen. Echter werden er weinig leads online geworven en bovendien werden&nbsp; deze&nbsp; niet geconverteerd. Daarom besloten ze hun lead nurtering proces om te gooien. Dit heeft geleid tot beter inzicht in het soort leads, maar ook tot een toename van het aantal (kwalitatieve) leads. Ook heeft Pentair een partner programma opgericht wat unieke content voor de partners van Pentair biedt. Onderdeel hiervan is een gepersonaliseerde portal, waarmee partners informatie te zien krijgen wat voor hen relevant is en waarmee ze makkelijker contact op kunnen nemen met hun contactpersonen.</p><p>De kansen voor de Smart Industry</p><p>Als afsluiter sprak keynote spreker Prof. Dr. Willem Vermeend over de kansen voor de&nbsp; Smart Industry. Vermeend is voormalig kamerlid, staatssecretaris en minister en momenteel sterk betrokken bij de ontwikkelingen van Nederland op het gebied van technologie. De belangrijkste les die Vermeend mee gaf is dat technologie sneller verandert dan wij denken: zorg er dus voor dat je als bedrijf op de hoogte blijft van de nieuwste ontwikkelingen en pas deze toe. Doe dit niet alleen, maar werk samen. Zo wordt het implementeren van nieuwe technologie makkelijker. Ook gaf hij een aantal vooruitzichten op het gebied van technologie: waterstof is dé toekomstige energiebron. En zelfsturende auto’s binnenkort op de weg? Dat gaat nog lang niet gebeuren! Vermeend, die nauw betrokken is bij een bedrijf dat zelfsturende auto’s maakt, weet hoe moeilijk het is om een zelfsturende auto zonder fouten te creëren en gaf aan dat het nog flink wat jaren gaat duren voordat deze auto de weg op mag. Zelfs na alle lezingen wist Prof. Dr. Willem Vermeend het publiek scherp te houden met zijn interessante verhaal over de ontwikkelingen binnen de technologische sector. Een goede afsluiter van dit inspirerende event!</p><p>Door Henny Hoekstra</p><p><br></p>",
        "title": null,
        "heroImage": "https://image.headless.rest/resized/innovadis/headerimage/0.jpg"
      }
    },
    "created": "2017-09-21T09:02:57.758Z",
    "updated": "2017-09-21T09:02:57.758Z"
  }
]