[
  {
    "content": {
      "nl": {
        "body": "<p><strong>Ervaren .NET back-end Developer (32-40u/w)</strong></p><p>Ben jij een ambitieuze ontwikkelaar en wil je aan innovatieve projecten werken? Wordt je enthousiast van webontwikkeling en sta jij je mannetje tijdens een potje tafelvoetbal of tafeltennis? Dan komen we graag met jou in contact!</p><p><strong>Wie zijn wij?</strong></p><p><strong> </strong>Innovadis is een gaaf, informeel en innovatief technologie bedrijf dat klanten zoals Vredestein, Leenbakker, Jaarbeurs, KWPN, Verhoeven en Pentair helpt commerciële doelstellingen te realiseren via innovatieve IT oplossingen in de vorm van webshops, portalen en interfaces. We zijn gevestigd op de welbekende CeeCee Campus in Enschede wat het centrum vormt van creativiteit en innovatie.&nbsp;</p><p>In zelfsturende, Agile teams, met enthousiaste vakmensen en gedreven specialisten realiseren we mooie projecten zoals een multi-channel business-to-business webshop voor Vredestein waarmee meer dan 18.000 Vredestein-dealers over de hele wereld (!) hun banden kunnen bestellen. Deze webshop is gekoppeld met de interne ICT systemen van Vredestein zodat de bestelling binnen 24 uur bij de garage ligt. Voor ASR-Ardanta hebben we een klantenportaal gebouwd waarmee duizenden klanten hun polissen kunnen inzien en verlengen. Daarnaast hebben we voor de Jaarbeurs een aan SAP gekoppelde webshop-generator gemaakt waarmee de Jaarbeurs voor elk evenement een mooi vormgegeven webshop voor de exposanten activeert.</p><p><strong>Wat wordt jouw rol binnen Innovadis?</strong></p><p>Als ervaren .NET developer werk je mee aan bestaande projecten maar je helpt ook bij het opzetten van innovatieve oplossingen. Je bouwt samen met je Scrum team aan de site of portal van een klant, waarbij gebruik wordt gemaakt van&nbsp;Dynamicweb als CMS.&nbsp;</p><p><strong>Wat verwachten we van je? </strong></p><p>Je hebt een HBO – WO werk denk niveau met een relevant diploma . Je beheerst .Net/C#, JavaScript, CSS3, HTML5 en bent een teamplayer.&nbsp;Kennis van Dynamicweb is een Pré.&nbsp;Je bent bekend met de Agile methodiek Scrum en bent niet bang de klant te woord te staan. </p><p><strong>Waarom Innovadis?</strong></p><p>Als Innovadër kom je elke ochtend je bed uit om met mooie innovatieve toepassingen de wereld een stukje beter te maken en échte waarde te leveren voor onze klanten. De verantwoordelijkheid, de bijbehorende vrijheid en de persoonlijke aanpak maken Innovadis tot een inspirerende plek om te werken, omdat wij geloven dat echte professionals zo het beste tot hun recht komen. Je krijgt bij ons de vrijheid en de middelen om jezelf te ontwikkelen en nieuwe ideeën te proberen. </p><p>Behalve hard werken vieren we ook de successen, de mooie opleveringen samen met de opdrachtgevers. Houden we bordspel, pizza en game avonden en worden er spraakmakende team uitjes georganiseerd. Daarnaast mag een dagelijks potje tafelvoetbal of tafeltennis niet ontbreken in het leven van een Innovadiër.</p><p><strong>&nbsp;</strong></p><p><strong>&nbsp;</strong></p><p><strong>De Aanbieding</strong></p><p>Naast uitdagende projecten en gave uitjes krijg je een goed salaris en bijbehorende secundaire arbeidsvoorwaarden zoals 26 vakantiedagen,&nbsp;een persoonlijk opleidingsbudget en een vrije keuze in eigen werkmateriaal. </p><p>Ben je nog steeds geïnteresseerd en zie je het leven als Innovadiër wel zitten? Dan komen we graag met je in contact! Heb je nog vragen over de vacature?&nbsp;Aarzel dan niet en neem contact op met Dewi Moester via <a href=\"mailto:d.moester@innovadis.com\" target=\"_blank\">d.moester@innovadis.com</a> &nbsp;of door te bellen naar 053 850 7500.</p><p><br></p>",
        "lead": "Ben jij een ambitieuze ontwikkelaar en wil je aan innovatieve projecten werken? Wordt je enthousiast van webontwikkeling en sta jij je mannetje tijdens een potje tafelvoetbal of tafeltennis?",
        "tech": ".Net/C#, JavaScript, CSS3, HTML5",
        "hours": "32 - 40",
        "title": ".NET back-end developer",
        "jobType": "developer"
      }
    },
    "created": "2017-09-21T09:27:27.905Z",
    "updated": "2017-09-22T10:14:30.164Z"
  }
]